Documents/МИКО_стЗаписьИсторииЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МИКО_стЗаписьИсторииЗвонков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Start</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Answer</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Billsec</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Disposition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_стВидыТелефонныхЗвонков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastApp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пропущенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutLine</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МИКО_стУчетныеЗаписиАТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recordingfile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НетСоединений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>channel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>dstchannel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛожныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>linkedid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>did</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>accountcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Src_Владелец_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dst_Владелец_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>roistatid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_pbx</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IdQueue</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgentQueue</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgentQueue_Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтвеченВВайбере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияCEL</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Eventtime</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cidnum</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Peer</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Appname</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndTime</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДлительности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МИКО_стВидыТелефонныхЗвонков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cidnum_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Peer_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Src_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>channel</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>dstchannel</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CDR_ПропустившиеЗвонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Disposition</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst_Ссылка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dst_ID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыСобытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Событие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИменаФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/МИКО_стВидыТелефонныхЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_стВидыТелефонныхЗвонков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/МИКО_стЗаписьИсторииЗвонков/Forms/ФормаДокумента/Ext/Form/Module.bsl
// #Область СлужебныеПроцедурыИФункции

&НаСервере
// Начальное заполнение документа.
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыАТС = ПолучитьПараметрыАТС(Объект.id_pbx);
	Хост		 = ПараметрыАТС.Получить("АдресСервера");
	Порт 		 = ПараметрыАТС.Получить("ПортСервера");
	
	Элементы.НаименованиеАТС.Заголовок = ПараметрыАТС.Получить("Наименование");
	
	Пропущен = (Объект.Пропущенный Или Объект.НетСоединений);
	
	// Получим системную информацию.
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
	// Видимость элементов формы.
	Элементы.Src_Владелец_Ссылка.Видимость = ЗначениеЗаполнено(Объект.Src_Владелец_Ссылка);
	Элементы.Dst_Владелец_Ссылка.Видимость = ЗначениеЗаполнено(Объект.Dst_Владелец_Ссылка);
	Элементы.Пропущен.Видимость            = Пропущен;
	Элементы.ОтвеченВВайбере.Видимость     = (Объект.ОтвеченВВайбере Или
											 (Пропущен И (Объект.Направление = Перечисления.МИКО_стВидыТелефонныхЗвонков.Входящий)));
    Элементы.Answer.Видимость              = (Не Пропущен И Не Объект.ОтвеченВВайбере);
	Элементы.ДеталиЗвонка.Видимость        = (Не Пропущен И Не Объект.ОтвеченВВайбере);
	
	ЭтоВнешнийВызов = Объект.Направление <> Перечисления.МИКО_стВидыТелефонныхЗвонков.Внутренний;
	Элементы.OutLine.Видимость 		= ЭтоВнешнийВызов;
	Элементы.Регион.Видимость  		= ЭтоВнешнийВызов;
	
	Элементы.ПропустившиеЗвонок.Видимость = Объект.CDR_ПропустившиеЗвонок.Количество()>0;
	ЭтаФорма.Заголовок = "" + Объект.Направление + " вызов от " + Формат(Объект.Дата, "ДЛФ=DDT");
	
	Если Объект.Направление = Перечисления.МИКО_стВидыТелефонныхЗвонков.Входящий Тогда
		Элементы.Пропущен.Заголовок = "Пропущен";
	Иначе	
		Элементы.Пропущен.Заголовок = "Не дозвонились";	
	КонецЕсли; 
	
	Попытка
		Элементы.грПрочиеКоманды.Видимость = (ИмяПользователя()="") ИЛИ РольДоступна("МИКО_стРедактированиеИсторииЗвонков") ИЛИ РольДоступна("ПолныеПрава");
	Исключение
	КонецПопытки; 
	
	// Видимость элементов формы
	ПанельТелефонииЕсть = Метаданные.Обработки.Найти("МИКО_ПанельТелефонииДля1С")<>Неопределено;
	Элементы.ФормадПрослушатьЗапись.Видимость 	= ПанельТелефонииЕсть;
	Элементы.ФормадСкачатьЗапись.Видимость 		= ПанельТелефонииЕсть;
	Элементы.Позвонить.Видимость 				=(ПанельТелефонииЕсть И ЭтоВнешнийВызов);
	Элементы.ПозвонитьDst.Видимость 			=(ПанельТелефонииЕсть И ЭтоВнешнийВызов);
	Элементы.ПозвонитьSrc.Видимость 			=(ПанельТелефонииЕсть И ЭтоВнешнийВызов);
	
	СтанцияMyPBX = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.СтанцияMyPBX();
КонецПроцедуры

// Определяем параметры АТС
//
Функция ПолучитьПараметрыАТС(id_pbx)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_ДополнительныеАТС.АдресСервера,
		|	МИКО_ДополнительныеАТС.ПортСервера,
		|	МИКО_ДополнительныеАТС.РесурсCDR,
		|	МИКО_ДополнительныеАТС.РесурсCEL,
		|	МИКО_ДополнительныеАТС.Наименование
		|ИЗ
		|	Справочник.МИКО_ДополнительныеАТС КАК МИКО_ДополнительныеАТС
		|ГДЕ
		|	МИКО_ДополнительныеАТС.id_pbx = &id_pbx";
	
	Запрос.УстановитьПараметр("id_pbx", id_pbx);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыАТС = Новый Соответствие;
		ПараметрыАТС.Вставить("Наименование", "Основная АТС");
		ПараметрыАТС.Вставить("РесурсCDR",    ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCDR());
		ПараметрыАТС.Вставить("АдресСервера", ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.АдресСервера()); 
		ПараметрыАТС.Вставить("ПортСервера",  ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПортСервера()); 		
	    ПараметрыАТС.Вставить("РесурсCEL",    ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.РесурсCEL());
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПараметрыАТС = Новый Соответствие;
			ПараметрыАТС.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
			ПараметрыАТС.Вставить("РесурсCDR",    ВыборкаДетальныеЗаписи.РесурсCDR);
			ПараметрыАТС.Вставить("АдресСервера", ВыборкаДетальныеЗаписи.АдресСервера); 
			ПараметрыАТС.Вставить("ПортСервера",  ВыборкаДетальныеЗаписи.ПортСервера); 		
		    ПараметрыАТС.Вставить("РесурсCEL",    ВыборкаДетальныеЗаписи.РесурсCEL);
		КонецЦикла;
	
	КонецЕсли; 
		
	Возврат ПараметрыАТС;
КонецФункции

&НаКлиенте
// Обработка взаимодействия с прочими внешними модулями.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если "ОповеститьЖЗ_ЗаписьРазговора" = ИмяСобытия Тогда	
		Если ОжидаемЗапись = Истина Тогда
			ОжидаемЗапись = Ложь;
			врЭлемент = ?(Параметр.ТипОперации = "СкачатьЗапись", Элементы.ФормадСкачатьЗапись, Элементы.ФормадПрослушатьЗапись);
			Если ВерсияПлатформы = "8.3" Тогда
				ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработкаВыбораФайлаЗаписи"", ЭтаФорма, Параметр)");
				Попытка
					Выполнить("ПоказатьВыборИзМеню(ОписаниеОповещения,Параметр.спИменаФайлов, врЭлемент)");
				Исключение
					Возврат;
				КонецПопытки; 
			Иначе	
				Попытка
					врЗначение = Вычислить("ВыбратьИзМеню(Параметр.спИменаФайлов, врЭлемент)");	
				Исключение
				   	// 
					Возврат;
				КонецПопытки; 
				ОбработкаВыбораФайлаЗаписи(врЗначение, Параметр)
			КонецЕсли;
		КонецЕсли; 
	ИначеЕсли "PT1C_NewOutLine" = ИмяСобытия И Параметр <> Объект.OutLine Тогда	
		Объект.OutLine = Параметр;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
// Запуск обратного звонка для воспроизведения файла.
// 
Процедура дПрослушатьЗапись(Команда)

	ИмяФайлаЗаписиРазговора = Объект.recordingfile; 
	
	СтруктураДанных = Новый Структура("ИмяФайла, ИдентификаторЗвонка", ИмяФайлаЗаписиРазговора, ?(СтанцияMyPBX, Объект.recordingfile, Объект.linkedid));
	
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	Если сфпФормаТелефон <> Неопределено Тогда
		ОжидаемЗапись = Истина;
		Оповестить("ВоспроизвестиЗапись", СтруктураДанных.ИдентификаторЗвонка, ЭтаФорма);
	ИначеЕсли Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.ПрослушатьЗаписьРазговора(СтруктураДанных.ИдентификаторЗвонка);
		Исключение
			// 	
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Панель телефонии не подключена! Нет возможности прослушать запись.");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Запуск процесса скачивания файла записи 
//
Процедура дСкачатьЗапись(Команда)
	
	ИмяФайлаЗаписиРазговора = Объект.recordingfile;
	
	СтруктураДанных = Новый Структура("ИмяФайла, ИдентификаторЗвонка", ИмяФайлаЗаписиРазговора, ?(СтанцияMyPBX, Объект.recordingfile, Объект.linkedid));
	
	// Найдем в какой глобальной переменной определена панель телефонии.
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	сфпФормаТелефон = МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииУп();
	
	Если сфпФормаТелефон <> Неопределено Тогда
		ОжидаемЗапись = Истина;
		Если СтанцияMyPBX Тогда
			врПараметры = Новый Структура("filename,fpath",СтруктураДанных.ИдентификаторЗвонка,"");
			Оповестить("СкачатьЗаписьПоИмениФайла", врПараметры, ЭтаФорма);
		Иначе	
			Оповестить("СкачатьЗапись", СтруктураДанных.ИдентификаторЗвонка, ЭтаФорма);
		КонецЕсли;
	ИначеЕсли Miko_Ajam	<> Неопределено Тогда
		Попытка
			Miko_Ajam.СкачатьЗаписьРазговора(СтруктураДанных);
		Исключение
			// 	
		КонецПопытки;
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Нет возможности скачать запись.");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	Вызов = Новый Структура("НомерТелефона,Партнер,Абонент,Входящий,ЕстьЗапись,recordingfile");
	Если ЗаполнитьПоДокументуИсторииЗвонков(Вызов, Объект.Ссылка) = Ложь Тогда
		// Внутренний вызов.
		Возврат;
	КонецЕсли;
	// Найдем в какой глобальной переменной определена панель телефонии.
	
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	
	Если Miko_Ajam <> Неопределено Тогда
		Miko_Ajam.НабратьНомер(Вызов.НомерТелефона);	
	Иначе
		врДанные = Новый Структура("ОснованиеЗвонка", Объект.Ссылка);
		Оповестить("Позвонить", Вызов.НомерТелефона, врДанные);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьПоНомеру(Команда)
	
	врИмяПоля = СтрЗаменить(Команда.Имя, "Позвонить", "");
	Вызов = Новый Структура("НомерТелефона", Объект[врИмяПоля]);
	
	Если НЕ ЗначениеЗаполнено(Вызов.НомерТелефона) Тогда
	   	Возврат;
	КонецЕсли; 
	
	Miko_Ajam 		= МИКО_стОбщегоНазначенияКлиент.ПолучитьОбъектПанелиТелефонииОб();
	
	Если Miko_Ajam <> Неопределено Тогда
		Miko_Ajam.НабратьНомер(Вызов.НомерТелефона);	
	Иначе
		врДанные = Новый Структура("ОснованиеЗвонка", Объект.Ссылка);
		Оповестить("Позвонить", Вызов.НомерТелефона, врДанные);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
// Вспомогательная функция, получает данные по документу "МИКО_стЗаписьИсторииЗвонков".
// 
Функция ЗаполнитьПоДокументуИсторииЗвонков(Вызов, СсылкаНаДокумент)
	Если СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Внутренний") Тогда
		Возврат Ложь;	
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Входящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Src_Владелец_Ссылка,Src_Ссылка,Src");
		Партнер				= врДанные.Src_Владелец_Ссылка;	
		Абонент 			= врДанные.Src_Ссылка;
		Вызов.НомерТелефона = врДанные.Src;
		Вызов.Входящий 		= Истина;
	ИначеЕсли СсылкаНаДокумент.Направление = ПредопределенноеЗначение("Перечисление.МИКО_стВидыТелефонныхЗвонков.Исходящий") Тогда
		врДанные = МИКО_стОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, "Dst_Владелец_Ссылка,Dst_Ссылка,Dst");
		Партнер 			= врДанные.Dst_Владелец_Ссылка;	
		Абонент 			= врДанные.Dst_Ссылка;
		Вызов.НомерТелефона = врДанные.Dst;
		Вызов.Входящий 		= Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		Вызов.Партнер = Партнер;	
		Вызов.Абонент = Абонент;	
	Иначе
		Вызов.Партнер = Абонент;	
	КонецЕсли;
	
	РезульатЗапроса = МИКО_стОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ИменаФайлов");
	Если НЕ РезульатЗапроса.Пустой() Тогда
		ИменаФайлов 		= РезульатЗапроса.Выгрузить();
		Вызов.ЕстьЗапись 	= Истина;
		Вызов.recordingfile = ИменаФайлов[0].ИмяФайла;
	Иначе	
		Вызов.ЕстьЗапись    = Ложь;
		Вызов.recordingfile = "";
	КонецЕсли; 
	
	Возврат Истина;	
КонецФункции


&НаКлиенте
// Открытие выбранного документа "Событие".
// 
Процедура ДокументыСобытиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СобытиеСсылка = Элемент.ТекущиеДанные.Событие;
		
	Если ВерсияПлатформы = "8.3" Тогда
		
		Если НЕ ИспользоватьРежимМодальности Тогда
		
			Попытка
				Выполнить("ПоказатьЗначение(,СобытиеСсылка)");
			Исключение
				Возврат;
			КонецПопытки; 
	
		Иначе	
			ОткрытьЗначение(СобытиеСсылка);
		КонецЕсли; 
		
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		ОткрытьЗначение(СобытиеСсылка);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Подготовить данные для отладки.
// 
Процедура ВывестиДанныеДляОтладки(Команда)
	ТекстОтладки = ПодготовитьДанныеДляОтладки(Объект.Номер);
	
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(ТекстОтладки);
	ТД.Показать();
КонецПроцедуры

&НаСервере
// Подготовить данные для отладки на сервере.
//
Функция ПодготовитьДанныеДляОтладки(UID)

	Если СтанцияMyPBX Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ *
			|ИЗ
			|	РегистрСведений.МИКО_стMyPBX_Asteriskcdr КАК МИКО_стИсторияЗвонковCDR
			|ГДЕ
			|	МИКО_стИсторияЗвонковCDR.uniqueid_pt1c = &UID";
	    Запрос.УстановитьПараметр("UID",UID);
		CDR = Запрос.Выполнить().Выгрузить();

		Данные = Новый Структура("CDR",CDR);
		Возврат ЗначениеВСтрокуВнутр(Данные);
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.МИКО_стИсторияЗвонковCDR КАК МИКО_стИсторияЗвонковCDR
		|ГДЕ
		|	МИКО_стИсторияЗвонковCDR.UID = &UID";
    Запрос.УстановитьПараметр("UID",UID);
	CDR = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.МИКО_стИсторияЗвонковCEL КАК МИКО_стИсторияЗвонковCEL
		|ГДЕ
		|	МИКО_стИсторияЗвонковCEL.UID = &UID";
    Запрос.УстановитьПараметр("UID",UID);
	CEL = Запрос.Выполнить().Выгрузить();

	Данные = Новый Структура("CDR,CEL",CDR,CEL);
	Возврат ЗначениеВСтрокуВнутр(Данные);
	
КонецФункции // ПодготовитьДанныеДляОтладки()

&НаКлиенте
// Обработка выбора имени файла из списка для прослушивания / скачивания.
// Параметры:
//   ВыбранныйЭлемент - Имя файла записи
//   врПараметры - Дополнительные параметры.
//
Процедура ОбработкаВыбораФайлаЗаписи(ВыбранныйЭлемент, врПараметры) Экспорт 
    Если ВыбранныйЭлемент = Неопределено  Тогда
	 	Возврат;
	КонецЕсли; 
	
	Если врПараметры.ТипОперации = "СкачатьЗапись" Тогда
		врПараметры = Новый Структура("filename,fpath",ВыбранныйЭлемент.Значение,врПараметры.ДопПараметры);
		Оповестить("СкачатьЗаписьПоИмениФайла", врПараметры, ЭтаФорма);		
	ИначеЕсли врПараметры.ТипОперации = "ВоспроизвестиЗапись" Тогда
		Оповестить("ВоспроизвестиЗаписьПоИмениФайла", ВыбранныйЭлемент.Значение, ЭтаФорма); 
	КонецЕсли; 	
КонецПроцедуры // ОбработкаВыбораФайлаЗаписи()


&НаКлиенте
Процедура ЗагрузитьПовторно(Команда)
	ЗагрузитьПовторноСервер();
КонецПроцедуры

// Повторная загрузка документа.
//
&НаСервере
Процедура ЗагрузитьПовторноСервер()
		
	МассивUID = Новый Массив;
	МассивUID.Добавить(Объект.Номер);
	мод_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
	
	Если СтанцияMyPBX Тогда
		ДанныеИзБазы = мод_стЗагрузкаИсторииЗвонков_v7.ПолучитьДанныеЗвонковCDR_Autorecord_MyPBX(МассивUID, МассивUID);
		мод_стЗагрузкаИсторииЗвонков_v7.ЗаполнитьОбработатьИсториюЗвонковCDR_MyPBX(Объект.Номер, ДанныеИзБазы);
	Иначе
		ДанныеИзБазы = мод_стЗагрузкаИсторииЗвонков_v7.ПолучитьДанныеЗвонковCEL_CDR(МассивUID, Объект.id_pbx);
		Если ДанныеИзБазы.ТабAskozia.Количество()>0 Тогда
			мод_стЗагрузкаИсторииЗвонков_v7.СформироватьДокументыИсторииAskozia(МассивUID, ДанныеИзБазы);
		Иначе
			мод_стЗагрузкаИсторииЗвонков_v7.ЗаполнитьОбработатьИсториюЗвонковПоUID(Объект.Номер, ДанныеИзБазы);
		КонецЕсли;
	КонецЕсли;

	врОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(врОбъект, "Объект");
	
КонецПроцедуры // ЗагрузитьПовторно()

&НаКлиенте
Процедура Детализация_СсылкаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Детализация_СсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь
КонецПроцедуры

// Поиск в записях докумнта истории идентификатора линии.
// 
&НаКлиенте
Процедура НайтиIDЛиний(Команда)
	
	врПараметры = Новый Структура("UID,OutLine,Направление", Объект.Номер, Объект.OutLine, Объект.Направление);	
	ОткрытьФорму("Справочник.МИКО_стУчетныеЗаписиАТС.Форма.ПомощникОписанияВнешнейЛинии", врПараметры, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтвеченВВайбереПриИзменении(Элемент)
	
	Пропущен = Не Объект.ОтвеченВВайбере;
	
	Объект.Пропущенный   = Пропущен;
	Объект.НетСоединений = Пропущен;
	
	Элементы.Пропущен.Видимость = Пропущен;
	
	Записать();
	
КонецПроцедуры
 


// #КонецОбласти
